ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/EAM_0.2.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="EAM" HW_revision="0.2">
    <register id="EAM_REVISION" width="32" offset="0x1000" description="IP revision id register">
        <bitfield id="REVISION" description="Revisoin register" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SECURITY_ERR_FLAG" width="32" offset="0x1010" description="Security error flag">
        <bitfield id="SECURE" description="Secure error flag" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PRIV" description="Privilege error flag" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="HDP" description="Hide protection error flag" begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLADDR" description="FPI ILLADDR flag" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLPROG" description="FPI ILLPROG flag" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLERASE" description="FPI ILLERASE flag" begin="5" end="5" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLRDVER" description="FPI ILLRDVER flag" begin="6" end="6" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLMODECH" description="FPI ILLMODECH flag" begin="7" end="7" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLCMD" description="FPI ILLCMD flag" begin="8" end="8" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FPI_ILLSIZE" description="FPI ILLSIZE flag" begin="9" end="9" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FLC_MMR_ACCESS_ERROR" description="FLC MMR ACCESS ERROR flag" begin="10" end="10" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="FLSEM_ACCESS_ERROR" description="FLSEM ACCESS ERROR flag" begin="11" end="11" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SECURITY_ERR_CLR" width="32" offset="0x1014" description="Security error clear">
        <bitfield id="SECURE" description="writing '1' will clear SECURITY_ERR_FLAG[SEC] register." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PRIV" description="writing '1' will clear SECURITY_ERR_FLAG[PRIV] register." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HDP" description="writing '1' will clear SECURITY_ERR_FLAG[HDP] register." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLADDR" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLADDR] register." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLPROG" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLPROG] register." begin="4" end="4" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLERASE" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLERASE] register." begin="5" end="5" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLRDVER" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLRDVER] register." begin="6" end="6" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLMODECH" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLMODECH] register." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLCMD" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLCMD] register." begin="8" end="8" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FPI_ILLSIZE" description="writing '1' will clear SECURITY_ERR_FLAG[FPI_ILLSIZE] register." begin="9" end="9" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FLC_MMR_ACCESS_ERROR" description="writing '1' will clear SECURITY_ERR_FLAG[FLC_MMR_ACCESS_ERROR] register." begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FLSEM_ACCESS_ERROR" description="writing '1' will clear SECURITY_ERR_FLAG[FLSEM_ACCESS_ERROR] register." begin="11" end="11" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="EAM_SECURITY_ERR_MSTID" width="32" offset="0x1018" description="Security error master id">
        <bitfield id="MSTID" description="Security error master ID. This field will be cleared along with the corresponding flag clear." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SECURITY_ERR_ADDR" width="32" offset="0x101C" description="Security error address">
    </register>
    <register id="EAM_FRI_SEC_FLAG" width="32" offset="0x1030" description="FRI SEC flag">
        <bitfield id="SEC" description="Single error correction error" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_FRI_SEC_CLR" width="32" offset="0x1034" description="FRI SEC clear">
        <bitfield id="SEC" description="writing '1' will clear FRI_SEC_FLAG[SEC] register." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="EAM_FRI_SEC_ADDR" width="32" offset="0x1038" description="FRI SEC address">
    </register>
    <register id="EAM_FRI_SEC_MSTID" width="32" offset="0x103C" description="FRI SEC master id">
        <bitfield id="MSTID" description="Single error correction error master ID. This field will be cleared along with the corresponding flag clear." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_FRI_DED_FLAG" width="32" offset="0x1050" description="FRI DED flag">
        <bitfield id="DED" description="Double error detect error" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DIAG_DED" description="diagnostic Double error detect error" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_FRI_DED_CLR" width="32" offset="0x1054" description="FRI DED clear">
        <bitfield id="SEC" description="writing '1' will clear FRI_DED_FLAG[DED] register." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DIAG_DED" description="writing '1' will clear FRI_DED_FLAG[DIAG_DED] register." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="EAM_FRI_DED_ADDR" width="32" offset="0x1058" description="FRI DED address">
    </register>
    <register id="EAM_FRI_DED_MSTID" width="32" offset="0x105C" description="FRI DED master id">
        <bitfield id="MSTID" description="Single error correction error master ID. This field will be cleared along with the corresponding flag clear." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_SEC_FLAG" width="32" offset="0x1070" description="SYSMEM SEC flag">
        <bitfield id="RD_SEC" description="Single error correction error during read" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="WR_SEC" description="diagnostic single error correction error during write" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_SEC_CLR" width="32" offset="0x1074" description="SYSMEM SEC clear">
        <bitfield id="RD_SEC" description="writing '1' will clear SYSMEM_SEC_FLAG[RD_SEC] register." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WR_SEC" description="writing '1' will clear SYSMEM_SEC_FLAG[WR_SEC] register." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_SEC_ADDR" width="32" offset="0x1078" description="SYSMEM SEC address">
    </register>
    <register id="EAM_SYSMEM_SEC_MSTID" width="32" offset="0x107C" description="SYSMEM SEC master id">
        <bitfield id="MSTID" description="Single error correction error master ID. This field will be cleared along with the corresponding flag clear." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_DED_FLAG" width="32" offset="0x1090" description="SYSMEM DED flag">
        <bitfield id="RD_DED" description="Double error detect error during read" begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="WR_DED" description="diagnostic Double error detect error during write" begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_DED_CLR" width="32" offset="0x1094" description="SYSMEM DED clear">
        <bitfield id="RD_DED" description="writing '1' will clear SYSMEM_DED_FLAG[RD_DED] register." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="WR_DED" description="writing '1' will clear SYSMEM_DED_FLAG[WR_DED] register." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="EAM_SYSMEM_DED_ADDR" width="32" offset="0x1098" description="SYSMEM DED address">
    </register>
    <register id="EAM_SYSMEM_DED_MSTID" width="32" offset="0x109C" description="SYSMEM DED master id">
        <bitfield id="MSTID" description="Single error correction error master ID. This field will be cleared along with the corresponding flag clear." begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>

</module>